# Напишите программу, которая выводит нечетные числа из заданного списка и останавливается,
# если встречает число 554.
# import random
# lst = [554]
# for i in range(random.randint(5, 15)): # Сколько чисел в списке
#     x = random.randint(500, 600)
#     lst.append(x) # добавляем переменную в конец списка
# print(lst)
# random.shuffle(lst) #перемешивание списка
# print(lst)
#
# for i in lst:
#     if i%2 != 0:
#         print(i, end = ' ')
#     if i == 554:
#         break

# #Сложить числа вещественного числа
# number = '5.679'
# sum = 0
# for i in number:
#     if i != '.':
#         sum += int(i)
# print(sum)

'''Посчитайте, сколько раз символ встречается в строке
stroka = 'Посчитайте, сколько раз символ встречается в строке'
simvol = 'с'
sum = 0
for i in stroka:
    if i == simvol:
        sum +=1
print(sum)'''